import sys
import socket

#=================================================================================================
# 从列表文件扫描
#=================================================================================================
def Scan(file):

    # 打开文件
    f = open(file, 'r')

    # 文件内容存放的变量
    host = []
    
    # 读取所有行并遍历
    for line in f.readlines():
        # 去除空格
        line = line.split()[0].strip()
        # 添加至列表
        host.append(line)
    
    # 把列表去重
    one = list(set(host))

    # 把列表排序
    one.sort()

    # 遍历每一条数据
    for c in one:

        name = c.strip()
        
        try:
            # 
            r = Check(name)

        except:
            pass

#=================================================================================================
# 检测域名对应的IP
#=================================================================================================
def Check(name):
    ip = socket.gethostbyname(name)
    print(ip)

# 单独检测一个域名
#Check("www.mofa.gov.tw")

# 从列表文件里检测
Scan("list.txt")